[Killed] BlockStatement
src/model/NumeroConta.ts:6:40
 export class NumeroConta {
     private _numero: string;
 
-    public constructor(numero: string) {
-        if(!this.temSeisDigitos(numero))
-            throw new NegocioErro("número da conta inválida");
-
-        this._numero = numero;
-    }
+    public constructor(numero: string) {}
 
     public get numero(): string {
killedBy: Transferencia serviço mock transferir com sucesso
statusReason: Error: conta de origem não encontrada

[Killed] ConditionalExpression
src/model/NumeroConta.ts:7:12
     private _numero: string;
 
     public constructor(numero: string) {
-        if(!this.temSeisDigitos(numero))
+        if(true)
             throw new NegocioErro("número da conta inválida");
 
killedBy: Transferencia serviço mock transferir com sucesso
statusReason: Error: número da conta inválida

[Killed] BooleanLiteral
src/model/NumeroConta.ts:7:12
     private _numero: string;
 
     public constructor(numero: string) {
-        if(!this.temSeisDigitos(numero))
+        if(this.temSeisDigitos(numero))
             throw new NegocioErro("número da conta inválida");
 
killedBy: Transferencia serviço mock transferir com sucesso
statusReason: Error: número da conta inválida
